quizmon/app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
SELECT "questions".* FROM "questions" WHERE "questions"."topic_id" = $1  [["topic_id", 12]]
---
  def index
    # topic_id is passed as a query on the endpoint
    # we filter by topic_id
    # if my_own is passed as a param
    # we filter questions where id is user_id
    @topic_id = params[:topic]
    @my_own = params[:my_own]

    if @topic_id == nil
      @questions = Question.all
    else
      @questions = Question.where(topic_id: @topic_id)

SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "completeds".* FROM "completeds" WHERE "completeds"."user_id" = $1 AND "completeds"."question_id" = $2 LIMIT $3  [["user_id", 6], ["question_id", 1], ["LIMIT", 1]]
---
  def show
    # if the user is logged in and if they completed this question
    # return that the user has completed it, :completed => true
    # if the user is logged in and if they didn't complete this
    # question, return :completed => false
    # if the user isn't logged in, don't return or include a :completed

    # begin/rescue block taken from application control
    # but the render is taken out

    @question = Question.find(params[:id])

    begin
      header = request.headers['Authorization']
      header = header.split(' ').last if header
      @decoded = decode(header)
      @completed_id = @decoded[:user_id]
      @my_completed = Completed.find_by({user_id: @completed_id, question_id: @question[:id]})

INSERT INTO "questions" ("content", "correct_answer", "answer_a", "answer_b", "answer_c", "answer_d", "private", "user_id", "topic_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    # there is a finite number of topics and we need to grab it using its id
    # the topics would've been called to a dragdown list on frontend with
    # a route to get all topics so the frontend has the ids

    @question = Question.new(question_params)
    @question.user = @current_user

    if @question.save

SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = $1 AND "questions"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 2], ["LIMIT", 1]]
---
  def set_question
    @question = @current_user.questions.find(params[:id])