quizmon/app/controllers/questions_controller.rb

  def create
    # there is a finite number of topics and we need to grab it using its id
    # the topics would've been called to a dragdown list on frontend with
    # a route to get all topics so the frontend has the ids

    @question = Question.new(question_params)
    @question.user = @current_user

    if @question.save
---
INSERT INTO "questions" ("content", "correct_answer", "answer_a", "answer_b", "answer_c", "answer_d", "private", "user_id", "topic_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"