app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "this question is dope"], ["user_id", 5], ["question_id", 5], ["created_at", "2020-06-10 18:34:28.896125"], ["updated_at", "2020-06-10 18:34:28.896125"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user = @current_user

    if @comment.save