app/controllers/completeds_controller.rb

  def create
    @completed = Completed.new(completed_params)
    @completed.user = @current_user

    if @completed.save
---
INSERT INTO "completeds" ("user_id", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["question_id", 5], ["created_at", "2020-06-10 18:35:58.719488"], ["updated_at", "2020-06-10 18:35:58.719488"]]