app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
  def index
    # topic_id is passed as a query on the endpoint
    # we filter by topic_id
    # if my_own is passed as a param
    # we filter questions where id is user_id
    @topic_id = params[:topic]
    @my_own = params[:my_own]
    @searchKeys = {}

    if @topic_id != nil
      @searchKeys[:topic] = @topic_id
    end

    if !@my_own || @my_own.downcase != 'true'
      @searchKeys[:private] = false
    end

    if @searchKeys.keys.length == 0
      @questions = Question.all